Repository: mrzeepek/evo_statusflow
Catalog: translations/*/ModulesEvostatusflowAdmin.*.xlf
Languages: fr_fr

source: Status Flow Rules
fr_fr: Règles de flux de statut

source: Add New Rule
fr_fr: Ajouter une nouvelle règle

source: Edit Rule
fr_fr: Modifier la règle

source: Error occurred: %error%
fr_fr: Une erreur s’est produite: %error%

source: Status flow command simulated successfully.
fr_fr: Commande de flux d’état simulée avec succès.

source: Status flow command executed successfully.
fr_fr: La commande Status flow a été exécutée avec succès.

source: Status Flow Logs
fr_fr: Journaux de flux d’état

source: Log entry not found
fr_fr: Entrée de journal introuvable

source: Log Details
fr_fr: Détails du journal

source: Database logging is currently disabled. No logs to clean up.
fr_fr: La journalisation de la base de données est actuellement désactivée. Pas de bûches à nettoyer.

source: Error when cleaning logs: %error%
fr_fr: Erreur lors du nettoyage des journaux : %error%

source: Error saving rule: %message%
fr_fr: Règle d’enregistrement des erreurs: %message%

source: Every hour
fr_fr: Toutes les heures

source: Every day
fr_fr: Tous les jours

source: Every week
fr_fr: Chaque semaine

source: Error saving configuration: %message%
fr_fr: Erreur lors de l’enregistrement de la configuration: %message%

source: Object Type
fr_fr: Type d’objet

source: Object ID
fr_fr: ID de l’objet

source: Rule ID
fr_fr: ID de règle

source: Warning
fr_fr: Avertissement

source: Error
fr_fr: Erreur

source: Rule
fr_fr: Règle

source: From Status
fr_fr: De Statut

source: To Status
fr_fr: Vers le statut

source: Delay (hours)
fr_fr: Retard (heures)

source: Auto-execute
fr_fr: Exécution automatique

source: Run Now
fr_fr: Lancer maintenant

source: Run All Rules
fr_fr: Lancer Toutes les règles

source: Advanced Order Status Management
fr_fr: Gestion avancée de l’état des commandes

source: Manage order statuses and automate status transitions with rules and cron jobs
fr_fr: Gérez les statuts des commandes et automatisez les transitions de statut avec des règles et des tâches cron

source: Are you sure that you want to uninstall? This will remove all transition rules and logs.
fr_fr: Êtes-vous sûr de vouloir désinstaller ? Cela supprimera toutes les règles de transition et les journaux.

source: Add New Status
fr_fr: Ajouter un nouveau statut

source: Edit Status
fr_fr: Modifier le statut

source: Rules define how orders should automatically move between different statuses.
fr_fr: Les règles définissent la manière dont les commandes doivent passer automatiquement d’un statut à l’autre.

source: Each rule defines a transition from one status to another, after an optional delay.
fr_fr: Chaque règle définit un passage d’un statut à un autre, après un délai facultatif.

source: Rules can be executed manually or automatically via a scheduled task.
fr_fr: Les règles peuvent être exécutées manuellement ou automatiquement via une tâche planifiée.

source: Manual Execution
fr_fr: Exécution manuelle

source: You can manually trigger the status flow processor to execute all active rules.
fr_fr: Vous pouvez déclencher manuellement le processeur de flux d’état pour exécuter toutes les règles actives.

source: Dry run (simulate without making changes)
fr_fr: Essai (simuler sans apporter de modifications)

source: Run Status Flow Processor
fr_fr: Processeur de flux d’état d’exécution

source: Cron Job Setup
fr_fr: Configuration de la tâche Cron

source: To automate status transitions, add the following command to your server cron jobs:
fr_fr: Pour automatiser les transitions de statut, ajoutez la commande suivante à vos tâches cron de serveur :

source: Recommended cron frequency based on your configuration:
fr_fr: Fréquence cron recommandée en fonction de votre configuration :

source: If set to "hourly":
fr_fr: Si défini sur « hourly » :

source: If set to "daily":
fr_fr: Si défini sur « quotidien » :

source: If set to "weekly":
fr_fr: Si défini sur « hebdomadaire » :

source: Database logging is currently disabled. You can enable it in the configuration.
fr_fr: La journalisation de la base de données est actuellement désactivée. Vous pouvez l’activer dans la configuration.

source: Log Maintenance
fr_fr: Entretien des journaux

source: Clean old logs now
fr_fr: Nettoyez les vieilles bûches maintenant

source: Additional Data
fr_fr: Données supplémentaires

source: Add new rule
fr_fr: Ajouter une nouvelle règle
